/////// EUROCODE Steel Moment Bolt Connection
IDC_GESMC_CHKDATA_SECT_GIRDER_NO1             = "不合適的大梁數量 : 大梁數量 < 1"
IDC_GESMC_CHKDATA_SECT_GIRDER_NO2             = "不合適的大梁數量 : 大梁數量 > 2"
IDC_GESMC_CHKDATA_SECT_COLUMN_NO1             = "不合適的柱子數量 : 柱子數量 < 1"
IDC_GESMC_CHKDATA_SECT_COLUMN_NO2             = "不合適的柱子數量 : 柱子數量 > 2"

IDC_GESMC_CHKDATA_SECT_ANGLE0                 = "不合適的角度設定 : 角度 < 0.0"
IDC_GESMC_CHKDATA_SECT_ANGLE360               = "不合適的角度設定 : 角度 > 360.0"
IDC_GESMC_CHKDATA_SECT_ANGLE_MINUS90          = "不合適的角度設定 : 角度 < -90.0"
IDC_GESMC_CHKDATA_SECT_ANGLE_PLUS90           = "不合適的角度設定 : 角度 > 90.0"
IDC_GESMC_CHKDATA_SECT_WELD_WEB_MIN           = "不合適的銲接喉厚 : 腹板處喉厚 < 0.0"
IDC_GESMC_CHKDATA_SECT_WELD_WEB_MAX           = "不合適的銲接喉厚 : 腹板處喉厚 > MAX."
IDC_GESMC_CHKDATA_SECT_WELD_FLG_MIN           = "不合適的銲接喉厚 : 翼板處喉厚 < 0.0"
IDC_GESMC_CHKDATA_SECT_WELD_FLG_MAX           = "不合適的銲接喉厚 : 翼板處喉厚 > MAX."
IDC_GESMC_CHKDATA_SECT_THROAT_THICK           = "\n銲接喉厚 = (銲腳長度) / √2"

IDC_GESMC_CHKDATA_BRACKET_TYPE                = "不合適的托架類型 : 請選擇H型或板"
IDC_GESMC_CHKDATA_BRACKET_PLATE_THK_MIN       = "不合適的托架板厚 : 板厚 < 0.0"
IDC_GESMC_CHKDATA_BRACKET_PLATE_THK_MAX       = "不合適的托架板厚 : 板厚 > MAX."
IDC_GESMC_CHKDATA_BRACKET_LENGTH_MIN          = "不合適的托架長度 : 長度 < 0.0"
IDC_GESMC_CHKDATA_BRACKET_LENGTH_MAX          = "不合適的托架長度 : 長度 > MAX."
IDC_GESMC_CHKDATA_BRACKET_HEIGHT1_MIN         = "不合適的托架高度 : 高度1 < 0.0"
IDC_GESMC_CHKDATA_BRACKET_HEIGHT1_MAX         = "不合適的托架高度 : 高度1 > MAX."
IDC_GESMC_CHKDATA_BRACKET_HEIGHT2_MIN         = "不合適的托架高度 : 高度2 < 0.0"
IDC_GESMC_CHKDATA_BRACKET_HEIGHT2_MAX         = "不合適的托架高度 : 高度2 > MAX."
IDC_GESMC_CHKDATA_SECT_CLASS_NO               = "不合適的斷面等級 : 請選擇 1, 2, 3, 4"
IDC_GESMC_CHKDATA_SECT_MODULUS0               = "不合適的斷面模數 : 斷面模數 < 0"

IDC_GESMC_CHKDATA_END_PLATE_THK_MIN           = "不合適的端板厚度 : 厚度 < 0.0"
IDC_GESMC_CHKDATA_END_PLATE_THK_MAX           = "不合適的端板厚度 : 厚度 > MAX."
IDC_GESMC_CHKDATA_END_PLATE_WID_MIN           = "不合適的端板寬度 : 寬度 < 0.0"
IDC_GESMC_CHKDATA_END_PLATE_WID_MAX           = "不合適的端板寬度 : 寬度 > MAX."
IDC_GESMC_CHKDATA_END_PLATE_EXTOP_MIN         = "不合適的端板延伸距離 : 上端 < 0.0"
IDC_GESMC_CHKDATA_END_PLATE_EXTOP_MAX         = "不合適的端板延伸距離 : 上端 > MAX."
IDC_GESMC_CHKDATA_END_PLATE_EXBOT_MIN         = "不合適的端板延伸距離 : 下端 < 0.0"
IDC_GESMC_CHKDATA_END_PLATE_EXBOT_MAX         = "不合適的端板延伸距離 : 下端 > MAX."

IDC_GESMC_CHKDATA_WEB_STIF_TYPE               = "不合適的柱腹板加勁板類型"
IDC_GESMC_CHKDATA_WEB_STIF_SIDE_NO1           = "不合適的柱腹板加勁板單側數量 : 數量 < 1"
IDC_GESMC_CHKDATA_WEB_STIF_SIDE_NO2           = "不合適的柱腹板加勁板單側數量 : 數量 > 2"
IDC_GESMC_CHKDATA_WEB_STIF_THK_MIN            = "不合適的柱腹板加勁板設定 : 厚度 < 0.0"
IDC_GESMC_CHKDATA_WEB_STIF_THK_MAX            = "不合適的柱腹板加勁板設定 : 厚度 > MAX."
IDC_GESMC_CHKDATA_WEB_STIF_WIDTH_MIN          = "不合適的柱腹板加勁板設定 : 寬度 < 0.0"
IDC_GESMC_CHKDATA_WEB_STIF_WIDTH_MAX          = "不合適的柱腹板加勁板設定 : 寬度 > MAX."
IDC_GESMC_CHKDATA_WEB_STIF_HEIGHT_MIN         = "不合適的柱腹板加勁板設定 : 高度 < 0.0"
IDC_GESMC_CHKDATA_WEB_STIF_HEIGHT_MAX         = "不合適的柱腹板加勁板設定 : 高度 > MAX."

IDC_GESMC_CHKDATA_FLG_STIF_THK_MIN            = "不合適的加勁板設定 : 厚度 < 0.0"
IDC_GESMC_CHKDATA_FLG_STIF_THK_MAX            = "不合適的加勁板設定 : 厚度 > MAX."
IDC_GESMC_CHKDATA_FLG_STIF_WIDTH_MIN          = "不合適的加勁板設定 : 寬度 < 0.0"
IDC_GESMC_CHKDATA_FLG_STIF_WIDTH_MAX          = "不合適的加勁板設定 : 寬度 > MAX."
IDC_GESMC_CHKDATA_FLG_STIF_CORNER_MIN         = "不合適的加勁板設定 : 截角尺寸 < 0.0"
IDC_GESMC_CHKDATA_FLG_STIF_CORNER_MAX         = "不合適的加勁板設定 : 截角尺寸 > MAX."

IDC_GESMC_CHKDATA_SHEAR_ROW_DESIGNATION       = "不合適的受剪列數設定 : 請選擇程式指定或手動指定"
IDC_GESMC_CHKDATA_BOLT_TYPE                   = "不合適的螺栓種類 : 請選擇普通或埋頭"
IDC_GESMC_CHKDATA_BOLT_LAYOUT_TYPE            = "不合適的螺栓配置類型 : 請選擇自動或自定義"
IDC_GESMC_CHKDATA_BOLT_SLIP_FACT_MIN          = "不合適的螺栓滑動因數 : 因數 < 0.0"
IDC_GESMC_CHKDATA_BOLT_SLIP_FACT_MAX          = "不合適的螺栓滑動因數 : 因數 > 1.0"
IDC_GESMC_CHKDATA_BOLT_ROW_IN_TOP_EXTENSION   = "不合適的螺栓配置 : 上方延伸段的排數 > 1"

IDC_GESMC_CHKDATA_BOLT_AUTO_COLUMN            = "不合適的行數配置 : 行數須為2"
IDC_GESMC_CHKDATA_BOLT_AUTO_ROW_TOP           = "不合適的排數配置 : 上方排數 < 1"
IDC_GESMC_CHKDATA_BOLT_AUTO_ROW_BOT           = "不合適的排數配置 : 下方排數 < 1"
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTHOR_MIN        = "不合適的延伸配置 : 水平向 < 0.0"
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTHOR_MAX        = "不合適的延伸配置 : 水平向 > MAX."
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTVER_MIN        = "不合適的延伸配置 : 垂直向 < 0.0"
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTVER_MAX        = "不合適的延伸配置 : 垂直向 > MAX."
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTTOP_MIN        = "不合適的延伸配置 : 垂直向 (上方) < 0.0"
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTTOP_MAX        = "不合適的延伸配置 : 垂直向 (上方) > MAX."
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTBOT_MIN        = "不合適的延伸配置 : 垂直向 (下方) < 0.0"
IDC_GESMC_CHKDATA_BOLT_AUTO_EXTBOT_MAX        = "不合適的延伸配置 : 垂直向 (下方) > MAX."
IDC_GESMC_CHKDATA_BOLT_AUTO_SPACEV_MIN        = "不合適的間距配置 : 垂直向 < 0.0"
IDC_GESMC_CHKDATA_BOLT_AUTO_SPACEV_MAX        = "不合適的間距配置 : 垂直向 > MAX."
IDC_GESMC_CHKDATA_BOLT_AUTO_SPACEH_MIN        = "不合適的間距配置 : 水平向 < 0.0"
IDC_GESMC_CHKDATA_BOLT_AUTO_SPACEH_MAX        = "不合適的間距配置 : 水平向 > MAX."
IDC_GESMC_CHKDATA_BOLT_AUTO_OFFSET_MIN        = "不合適的Offset配置 : Offset < 0.0"
IDC_GESMC_CHKDATA_BOLT_AUTO_OFFSET_MAX        = "不合適的Offset配置 : Offset > MAX."

IDC_GESMC_CHKDATA_BOLT_USER_COLUMN            = "不合適的行數配置 : 行數須為2" 
IDC_GESMC_CHKDATA_BOLT_USER_SPACEH_MIN        = "不合適的間距配置 : 水平向 < 0.0" 
IDC_GESMC_CHKDATA_BOLT_USER_SPACEH_MAX        = "不合適的間距配置 : 水平向 > MAX."
IDC_GESMC_CHKDATA_BOLT_USER_TOP_NONE          = "不合適的配置 : 上方位置不存在"
IDC_GESMC_CHKDATA_BOLT_USER_TOP_ZERO          = "不合適的配置 : Zero Position is Exist in Top."
IDC_GESMC_CHKDATA_BOLT_USER_BOT_NONE          = "不合適的配置 : 下方位置不存在"
IDC_GESMC_CHKDATA_BOLT_USER_BOT_ZERO          = "不合適的配置 : Zero Position is Exist in Bottom."

IDC_GESMC_CHKDATA_FORC_EMPTY                  = "不合適的載重組合 : 未輸入載重組合"
IDC_GESMC_CHKDATA_FORC_UNEQUAL                = "不合適的載重組合 : 載重組合的數量不相符"
IDC_GESMC_CHKDATA_FORC_NOT_SELECT             = "不合適的載重組合 : 未選取載重組合"

IDC_GESMC_CHKDATA_FACT_MIN                    = "不合適的折減因數 : 因數 < 0.0"
IDC_GESMC_CHKDATA_FACT_MAX                    = "不合適的折減因數 : 因數 > MAX."

IDC_GESMC_CHKDATA_DISP_TYPE                   = "不合適的預覽類型"

IDS_EC_TB_NAME_CHECK_ITEMS                    = "檢核項目"
IDS_EC_TB_NAME_VALUE                          = "數值"
IDS_EC_TB_NAME_CRITERIA                       = "規範標準"
IDS_EC_TB_NAME_REMARK                         = "備註"
IDS_EC_TB_NAME_GIRDER_FLG                     = "大梁翼板"
IDS_EC_TB_NAME_GIRDER_WEB                     = "大梁腹板"
IDS_EC_TB_NAME_HAUNCH_FLG                     = "梁腋翼板"
IDS_EC_TB_NAME_HAUNCH_WEB                     = "梁腋腹板"
IDS_EC_TB_NAME_RESISTANCE_CHK                 = "抵抗力檢核"
IDS_EC_TB_NAME_WELDTHICK_CHK                  = "銲接喉厚檢核"

IDS_EC_TB_NAME_DESIGN_METHOD_EAM              = "Equivalent T-stub Method"
IDS_EC_TB_NAME_DESIGN_METHOD_FEM              = "Finite Element Method"
IDC_EC_TB_NAME_WELD_CHECK                     = "銲接檢核"